#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>
#include <conio.h>
#include<string.h>
#include <stdlib.h>
#include <windows.h>
#include "worker.h"
//#include "user.h"
#include "Sea_Tour.h"
#include "Sea_Child_Tour.h"
#include "Mounty_tour.h"
#include "Wellness_Tour.h"
//#include "tour.h"
#include "menuadm.h"
using namespace std;

char MenuAuthorised();

void main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	Worker *ob= new Worker,ob1[20];
	MenuAdm menu;
	int u;
	while(1)
	{
		system("cls");
		int count;
		switch(MenuAuthorised())
		{
		case '1': ////////////////////////////Администратор
			count=ob->open_File_adm(ob);
			if(count)  /////////////////////////////Вход
			{
				u=ob->enter();
				if(u)
				{
					system("cls");
					cout<<"Вы вошли, администратор"<<endl;
					menu.admin_Work();
				}
				else 
					cout<<"Неверный логин или пароль\a"<<endl;
			}
			else///////////////////////////////регистрация
			{
				   ob->reg();
				   menu.admin_Work();
			}
			system("pause");
		break;

		case '2': /////////////////////////////////////Пользователь
			system("cls");
			cout<<"\n 1.Вход"<<endl;
			cout<<" 2.Регистрация"<<endl;
			cout<<" 0.Назад"<<endl;
			cout<<" Ваш выбор: ";
			char vibor;
			vibor=_getch();
			putchar(vibor);
			count=ob1->open_File(ob1);
			switch(vibor)
			{
			case '1':
				/////////////////////////////////////////////////////Вход
				u=ob1->enter_pols(ob1,count);
				if(u)
				{
					cout<<"Вы вошли, пользователь"<<endl;
						menu.user_Work();
				}
				else
				cout<<"Неверный логин или пароль\a"<<endl;
				system("pause");
				break;
				//////////////////////////////////////////////////////////////Регистрация
			case '2':
				u=ob1[count].reg_pols(ob1,count);
				if(u)
				{
					count++;
					menu.user_Work();
				}
					system("pause");
				break;

			case '0':break;
				default: 
				printf("\nНеверный выбор\n");
			}
			//system("pause");
			break;
		case '0':
			cout<<endl;
			return ;
		default: 
			printf("\nНеверный выбор\n");
			system("pause");
		}
	}

}

char MenuAuthorised()
{ 
	char u;
	cout<<"\n\t** А В Т О Р И З А Ц И Я ** \n"<<endl;
	cout<<"\t1.Администратор\n\t2.Менеджер по продажам\n\t0.Выход из программы\n";
	cout<<"\tВаш выбор:";
	cin>>u;
	return u;
}
//char MenuAdmin()
//{ 
//	char k;
//	cout << endl << endl << "**** МЕНЮ ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Работа с данными <Клиенты>" << endl;
//	cout << "2.Работа с данными <Туры>" << endl;
//	cout << "3.Прайс лист" << endl;
//	cout << "0.Выход" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//int MenuUser()
//{
//	int k;
//	cout << endl << endl << "**** МЕНЮ ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Работа с данными <Клиенты>" << endl;
//	cout << "2.Работа с данными <Туры>" << endl;
//	cout << "0.Выход" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//
////int enterFieldValue()
////{
////	int fl=0;
////	double x;
////	while(fl == 0)
////	{
////		cin >> x;
////		if(!cin || x!=int(x))
////		{
////			cout << endl; cout << "Ошибка ввода!" << endl;
////			cout << "Повторите ввод, пожалуйста: " << endl;
////			cin.clear();
////			while(cin.get()!='\n');
////			continue;
////		}
////		else fl++;
////	}
////	return x;
////}
//int Menu_for_Clients()
//{
//	int k;
//	cout << endl << endl << "**** МЕНЮ ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Просмотр всех клиентов" << endl;
//	cout << "2.Просмотреть путёвки, реализованные в текущем месяце" << endl;
//	cout << "0.Вернуться в главное меню" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//int Menu_for_Clients_pols()
//{
//	int k;
//	cout << endl << endl << "**** МЕНЮ ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Добавление клиента" << endl;
//	cout << "2.Просмотр всех клиентов" << endl;
//	cout << "0.Вернуться в главное меню" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//int Menu_operations_Pols()
//{
//	int k;
//	cout << endl << endl << "**** МЕНЮ ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Просмотр всех записей" << endl;
//	cout << "2.Поиск туров по стране и стоимости" << endl;
//	cout << "3.Поиск туров по отелю и типу питания" << endl;
//	cout << "4.Поиск горящих туров" << endl;
//	cout << "0.Вернуться в главное меню" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//
//int Menu_operations_Admin()
//{
//	int k;
//	cout << endl << endl << "**** МЕНЮ ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Добавление новой записи" << endl;
//	cout << "2.Просмотр всех записей" << endl;
//	cout << "3.Редактирование записи" << endl;
//	cout << "4.Удаление записи" << endl;
//	cout << "5.Поиск туров по стране и стоимости" << endl;
//	cout << "6.Поиск туров по отелю и типу питания" << endl;
//	cout << "7.Вывод  горящих туров" << endl;
//	cout << "0.Вернуться в главное меню" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//int Menu_choice_tour()
//{
//	int k;
//	cout << endl << endl << "**** ВЫБЕРИТЕ ТИП ТУРА ****" << endl;
//	cout << "===================" << endl << endl;
//	cout << "1.Морской тур" << endl;
//	cout << "2.Горнолыжный тур" << endl;
//	cout << "3.Детские лагеря" << endl;
//	cout << "4.Детские санатории на море" << endl << endl;
//	cout << "0.Выход" << endl << endl;
//	cout << "===================" << endl;
//	cout << "Ваш выбор:" << endl;
//	cin >> k;
//	return k;
//}
//void admin_Work()
//{
//	char country[30],hotel[20],Ftip[10],Name[30],kod_tour[10],passport[20],Name_sotr[30],res_kod[20];
//	int cost,k,tel_number,date_viezd[3],date_reg[3],d,mn,y,date[3];
//	Tour *t[50],*tm[50],*tw[50],*ts[50];//*tr,*tr1,*tr2,*tr3;
//	Sea_Tour s[20];
//	Mounty_Tour m[20];
//	Child_Tour w[20];
//	Sea_Child_Tour sch[20];
//	Client <int,char> *pl[20];
//	//Client <int,char> cl[20];
//	//Sea_Tour s;
//	//Mounty_Tour m;
//	//Child_Tour w;
//	//Sea_Child_Tour sch;
//	//tr=&s;
//	//tr1=&m;
//	//tr2=&w;
//	//tr3=&sch;
//	system("pause");
//	int number;
//	int count_mounty=0;
//	int count_wellness=0;
//	int count_ch_sea=0;//Sea_Child_Tour
//	int count=0;
//	int count_cl=0;
//	count=s->open_File(s);//////ЧТЕНИЕ ИЗ ФАЙЛА
//	count_mounty =m->open_File(m);
//	count_wellness=w->open_File(w);
//	count_ch_sea=sch->open_File(sch);
//	//count_cl=cl->open_File(cl);
//	//pl[0]=new Client<int,char>;
//	count_cl=pl[0]->open_File(pl);
//	/////////////////////////////////////////////////////////////////////////////////////
//
//	int i,x,com,percent;
//	while(1){
//		system("cls");
//		int Cl=0,Tr=0,Pr=0;
//	switch(MenuAdmin())
//	{
//	case '0': return;
//		///////////////////////////////////////////////РАБОТА С КЛИЕНТАМИ////////////////////////////////////
//	case '1':
//		while (!Cl) {
//			system("cls");
//			switch (Menu_for_Clients()) {				
//			case 1:
//				i=count_cl;
//				cout << "==============================================================================================" << endl;
//				cout << " ФИО клиента     Телефон     Номер       Код тура    Дата       ФИО           Дата" << endl ;
//				cout << "                             паспорта                выезда     регистратора  регистрации" << endl;
//				cout << "==============================================================================================" << endl;
//				for(int i=0;i<count_cl;i++)
//				{
//					cout <<  i+1 <<".";
//					pl[i]->see();
//					//cl[i].see();
//				}
//				if(!i) 
//				{
//					cout << "Нет данных о клиентах" << endl;
//				}
//				system("pause");
//				break;
//				////////////////////////////////////ОТЧЁТ ПО МЕСЯЦУ///////////////////////////////////////////////////////////////////////////////////
//			case 2:
//cout << "Введите текущий месяц: " ;
//cin >> mn;
//cout << "Введите текущий год:XXXX\b\b\b\b" ;
//cin >> y;
//x=0,com=0;
//cout << " =======================================================================================================" <<endl;
//cout << "     Клиент     №Телефона      Код     Сотрудник-        Дата           Общая         Стоимость   Валюта" << endl;
//cout << "                               тура    регистратор       регистрации    стоимость     тур услуги"<< endl;
//cout << " =======================================================================================================" <<endl;
//for( i=0;i<count_cl;i++)
//{
//	if(pl[i]->see_date(mn,y))
//	{
//		pl[i]->see1();
//		strcpy(res_kod,pl[i]->see_date(mn,y));
//		for(int j=0;j<count;j++)
//		{
//			x+=s[j].print(res_kod);
//			com+=s[j].print_com(res_kod);
//		}
//		for(int j=0;j<count_mounty;j++)
//		{
//			x+=m[j].print(res_kod);
//			com+=m[j].print_com(res_kod);
//		}
//		for(int j=0;j<count_wellness;j++)
//		{
//			x+=w[j].print(res_kod);
//			com+=w[j].print_com(res_kod);
//		}
//		for(int j=0;j<count_ch_sea;j++)
//		{
//			x+=sch[j].print(res_kod);
//			com+=sch[j].print_com(res_kod);
//		}
//	}
//}
//if(x){
//	cout << endl;
//cout << "Были реализованы путёки на сумму " << x << " BR" << endl;
//cout << "Прибыль тур агенства за счёт стоимости туристической услуги: " << com << " BR," << endl;
//x=(double)x;
//com=(double)com;
//cout << "что составляет " << (double)com/x*100 << " % от общей суммы"<<endl << endl;
//
//cout << "Отделу по работе с клиентами: " << endl;
//cout << "----------------------------------------------------" << endl;
//com=0;
//
//	com=pl[0]->poisk_sotr(pl,count_cl);
//	cout << "----------------------------------------------------" << endl;
//	cout << "начислить премию к заработной плате в размере 3%" <<endl; 
//	cout << "от общей стоимости реализованных путёвок, что составит ";
//	percent=(double)x*0.03;
//	cout << percent<< " BR" << endl;
//	cout << "----------------------------------------------------" << endl << endl;
//		cout << "Размер премии на одно человека составит: " << (double)percent/com << " BR" << endl;
//system("pause");
//}
//else{ 
//	cout << endl;
//	cout <<"По Вашему запросу ничего не найдено" << endl;
//	system("pause");
//}
//break;
//			case 0:Cl=1;
//				break;
//			}
//			//break;
//		}
//		break;
//		///////////////////////////////////////////////РАБОТА С ТУРАМИ////////////////////////////////////////////////
//	case '2': 
//
//		while (!Tr) {
//			system("cls");
//			switch (Menu_operations_Admin()) {
//			case 1: 
//				switch (Menu_choice_tour())
//				{
//					//system("cls");
//				case 1: 
//					i=count;
//					//t[i]=new Sea_Tour;////////////////////с полиморф.
//					//t[i]->add(t,i,count);
//					s[i].add(t,i,count);
//					count++;
//
//					/*	for(int k=0;k<count;k++)
//					t[k]->write_File(t,k,count);*/
//					//for(int k=0;k<count;k++)
//					s->write_File(s,i,count);
//					cout<< count<<endl;
//					system("pause");
//					break;
//
//				case 2:
//					i=count_mounty;
//					//tm[i]=new Mounty_Tour;
//					//tm[i]->add(tm,i,count_mounty);
//					m[i].add();
//					count_mounty++;
//					m->write_File(m,count_mounty);
//					////tr1->write_File(tm,count_mounty);
//					system("pause");
//					break;
//
//				case 3:
//					i=count_wellness;
//					//tw[i]=new Child_Tour;
//					//tw[i]->add(tw,i,count_wellness);
//					w[i].add();
//					count_wellness++;
//					////tr2->write_File(tw,count_wellness);
//					w->write_File(w,count_wellness);
//					system("pause");
//					break;
//
//				case 4:
//					i=count_ch_sea;
//					//ts[i]=new Sea_Child_Tour;
//					//ts[i]->add(ts,i,count_ch_sea);
//					sch[i].add();
//					count_ch_sea++;
//					sch->write_File(sch,count_ch_sea);
//					////tr2->write_File(tw,count_wellness);
//					system("pause");
//					break;
//				}
//				break;
//				////////////////////////////////////////////ПРОСМОТР/////////////////////////////////////////////////////////////////////////////
//			case 2:
//				cout << "\nДОСТУПНЫЕ ТУРЫ" << endl << endl;
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				//cout<< s.get_currency() << endl;
//				for(int j=0;j<count;j++)
//					t[j]=&s[j];
//				for(i=0; i<count; i++)
//				{
//					cout <<  i+1 <<".";
//					t[i]->print();
//					//s[i].print();
//
//				}
//				cout << "\n================================================================================================" << endl;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(i=0; i<count_mounty; i++)
//				{
//					tm[i]=&m[i];
//				}
//				for(i=0; i<count_mounty; i++)
//				{
//					cout <<  i+1 <<".";
//					tm[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for(i=0; i<count_wellness; i++)
//				{
//					tw[i]=&w[i];
//				}
//				for(i=0; i<count_wellness; i++)
//				{
//					cout <<  i+1 <<".";
//					tw[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//
//				cout << "\n==============================================================================================" << endl;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "================================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "================================================================================================================" << endl;
//				for(i=0; i<count_ch_sea; i++)
//				{
//					ts[i]=&sch[i];
//				}
//				for(i=0; i<count_ch_sea; i++)
//				{
//					cout <<  i+1 <<".";
//					ts[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//
//				system("pause");
//				break;
//				///////////////////////////////////////////////РЕДАКТИРОВАНИЕ///////////////////////////////////////////////////////////////////////////
//			case 3:
//				switch (Menu_choice_tour())
//				{
//				case 1:
//					cout << "\nМОРСКИЕ ТУРЫ" << endl;
//					cout << "==================================================================================================" << endl;
//					cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//					cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//					cout << "==================================================================================================" << endl;
//					//cout<< s.get_currency() << endl;
//					for(int j=0;j<count;j++)
//						t[j]=&s[j];
//					for(i=0; i<count; i++)
//					{
//						cout <<  i+1 <<".";
//						t[i]->print();
//					}
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//					cout << endl; cout << "Введите номер тура для изменения" << endl;
//					number=s->enterRecordNumber(count);
//					s[number-1].red();
//					s->write_File(s,i,count);
//					system("pause");
//					}
//					break;
//
//				case 2:
//					cout << "\n================================================================================================" << endl;
//					cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//					cout << "==================================================================================================" << endl;
//					cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//					cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//					cout << "==================================================================================================" << endl;
//					for(i=0; i<count_mounty; i++)
//						tm[i]=&m[i];
//					for(i=0; i<count_mounty; i++)
//					{
//						cout <<  i+1 <<".";
//						tm[i]->print();
//					}
//
//					cout << "\n==============================================================================================" << endl;
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//						cout << endl; cout << "Введите номер тура для изменения" << endl;
//						number=m->enterRecordNumber(count_mounty);
//						m[number-1].red();
//						m->write_File(m,count_mounty);
//						system("pause");
//					}
//					break;
//
//				case 3:
//					cout << "\n===========================================================================================================" << endl;
//					cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//					cout << "=============================================================================================================" << endl;
//					cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//					cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//					for(i=0; i<count_wellness; i++)
//						tw[i]=&w[i];
//					for(i=0; i<count_wellness; i++)
//					{
//						cout <<  i+1 <<".";
//						tw[i]->print();
//					}
//					cout << "\n===========================================================================================================" << endl;
//
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//						cout << endl; cout << "Введите номер тура для изменения" << endl;
//						number=w->enterRecordNumber(count_wellness);
//						w[number-1].red();
//						w->write_File(w,count_wellness);
//						system("pause");
//					}
//
//					break;
//
//				case 4:
//					cout << "\n==============================================================================================================" << endl;
//
//					cout << "\n==============================================================================================================" << endl;
//					cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//					cout << "================================================================================================================" << endl;
//					cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//					cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//					cout << "================================================================================================================" << endl;
//					for(i=0; i<count_ch_sea; i++)
//						ts[i]=&sch[i];
//					for(i=0; i<count_ch_sea; i++)
//					{
//						cout <<  i+1 <<".";
//						ts[i]->print();
//					}
//					cout << "\n===============================================================================================================" << endl;
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//						cout << endl; cout << "Введите номер тура для изменения" << endl;
//						number=sch->enterRecordNumber(count_ch_sea);
//						sch[number-1].red();
//						sch->write_File(sch,count_ch_sea);
//						system("pause");
//					}
//				}
//
//				break;
//				///////////////////////////////////////////////УДАЛЕНИЕ/////////////////////////////////////////////////////////////////////
//			case 4:
//				switch (Menu_choice_tour())
//				{
//				case 1:
//
//					cout << "\nМОРСКИЕ ТУРЫ" << endl;
//					cout << "==================================================================================================" << endl;
//					cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//					cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//					cout << "==================================================================================================" << endl;
//					//cout<< s.get_currency() << endl;
//
//					for(i=0; i<count_mounty; i++)
//						t[i]=&s[i];
//					for(i=0; i<count; i++)
//					{
//						cout <<  i+1 <<".";
//						t[i]->print();
//					}
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//						cout << endl; cout << "Введите номер для удаления" << endl;
//						number=s->enterRecordNumber(count);
//						for(i=number-1;i<count;i++)
//							s[i]=s[i+1];
//						count --;
//						s->write_File(s,i,count);
//						system("pause");
//					}
//					break;
//
//				case 2:
//					cout << "\n================================================================================================" << endl;
//					cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//					cout << "==================================================================================================" << endl;
//					cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//					cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//					cout << "==================================================================================================" << endl;
//					for(i=0; i<count_mounty; i++)
//						tm[i]=&m[i];
//					for(i=0; i<count_mounty; i++)
//					{
//						cout <<  i+1 <<".";
//						tm[i]->print();
//					}
//					cout << "\n===============================================================================================" << endl;
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//						cout << endl; cout << "Введите номер для удаления" << endl;
//						number=m->enterRecordNumber(count_mounty);
//						for(i=number-1;i<count_mounty;i++)
//							m[i]=m[i+1];
//						count_mounty --;
//						m->write_File(m,count_mounty);
//						system("pause");
//					}
//					break;
//
//
//				case 3:
//					cout << "\n===========================================================================================================" << endl;
//					cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//					cout << "=============================================================================================================" << endl;
//					cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//					cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//					cout << "=============================================================================================================" << endl;
//					for(i=0; i<count_wellness; i++)
//						tw[i]=&w[i];
//					for(i=0; i<count_wellness; i++)
//					{
//						cout <<  i+1 <<".";
//						tw[i]->print();
//					}
//					cout << "\n===========================================================================================================" << endl;
//
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{
//						cout << endl; cout << "Введите номер для удаления" << endl;
//						number=w->enterRecordNumber(count_wellness);
//						for(i=number-1;i<count_wellness;i++)
//							w[i]=w[i+1];
//						count_wellness --;
//						w->write_File(w,count_wellness);
//						system("pause");
//					}
//					break;
//
//				case 4:
//
//					cout << "\n==============================================================================================================" << endl;
//					cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//					cout << "================================================================================================================" << endl;
//					cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//					cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//					cout << "================================================================================================================" << endl;
//					for(i=0; i<count_ch_sea; i++)
//						ts[i]=&sch[i];
//					for(i=0; i<count_ch_sea; i++)
//					{
//						cout <<  i+1 <<".";
//						ts[i]->print();
//					}
//					cout << "\n===============================================================================================================" << endl;
//					if(!i)
//					{
//						cout << "Нет записей" <<endl;
//						system("pause");
//					}
//					else{cout << endl; cout << "Введите номер для удаления" << endl;
//					number=sch->enterRecordNumber(count_ch_sea);
//					for(i=number-1;i<count_ch_sea;i++)
//						sch[i]=sch[i+1];
//					count_ch_sea --;	
//					sch->write_File(sch,count_ch_sea);
//					system("pause");
//					}
//					break;
//					//					fflush stdin;
//					//			        gets(city);
//					//					for(i=0; i<count; i++)
//				}
//
//				break;
//				////////////////////////////////////////////ПОИСК/////////////////////////////////////////////
//			case 5:
//				k=0;
//				cout << "Введите страну для поиска: ";
//				fflush stdin;
//				gets(country);
//				cout << "Введите максимальную стоимость для поиска:                BR\b\b\b\b\b\b\b\b\b\b\b";
//				cin >> cost;
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//
//				for(int i=0;i<count;i++)
//				{
//					x=s[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(int i=0;i<count_mounty;i++)
//				{
//					x=m[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for(int i=0;i<count_wellness;i++)
//				{
//					x=w[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "================================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "================================================================================================================" << endl;
//				for(int i=0;i<count_ch_sea;i++)
//				{
//					x=sch[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				system("pause");
//				break;
//				//////////////////////////////////////////////ПОИСК/////////////////////////////////////////////////////////////////
//			case 6:
//				k=0;
//				cout << "Введите количество звёзд отеля: ";
//				fflush stdin;
//				gets(hotel);
//				cout << "Введите тип питания (AL,BB,HB): ";
//				fflush stdin;
//				gets(Ftip);
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(int i=0;i<count;i++)
//				{
//					x=s[i].poisk_hotel_ftip(hotel,Ftip);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(int i=0;i<count_mounty;i++)
//				{
//					x=m[i].poisk_hotel_ftip(hotel,Ftip);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				system("pause");
//				break;
//				///////////////////////////////////////////////////////////////////////////////////
//			case 7:
//				k=0;
//				cout << "Сегоднишнюю ДАТУ" << endl;
//				cout << "Введите день: " ;
//				cin >> date[0];
//				cout << "Введите  месяц: " ;
//				cin >> date[1];
//				cout << "Введите год: " ;
//				cin >>  date[2];
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(int i=0;i<count;i++)
//				{
//					x=s[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout  << setw(98) <<"Не найдено туров" << endl;
//				k=0;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(int i=0;i<count_mounty;i++)
//				{
//					x=m[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout << setw(98) <<"Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for(int i=0;i<count_wellness;i++)
//				{
//					x=w[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout  << setw(98) <<"Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "=================================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "=================================================================================================================" << endl;
//				for(int i=0;i<count_ch_sea;i++)
//				{
//					x=sch[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout << setw(98) << "Не найдено туров" << endl;
//				system("pause");
//				break;
//			case 0: Tr=1;
//				break;
//			}
//		}
//
//		break;
//
//
//
//		////////////////////////////////////////////////ПРАЙС ЛИСТ/////////////////////////////////////////////
//	case '3':
//		cout << "\nМОРСКИЕ ТУРЫ" << endl;
//		cout << "==============================================================================================" << endl;
//		cout << "Код    Стоимость    Стоимость проживания       Стоимость      Страховка    Общая      Валюта  " << endl;
//		cout << "        проезда          и питания            тур. услуги                  стоимость          " << endl;
//		cout << "==============================================================================================" << endl;
//		for(int i=0;i<count;i++)
//		{
//			s[i].print_price();
//		}
//
//		cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//		cout << "=========================================================================================================" << endl;
//		cout << "Код    Стоимость    Стоимость проживания    Стоимость       Страховка  Стоимость       Общая       Валюта" << endl;
//		cout << "        проезда          и питания          тур. услуги                горнолыжного    стоимость  " << endl;
//		cout << "                                                                       инвентаря " << endl;  
//		cout << "=========================================================================================================" << endl;
//		for(int i=0;i<count_mounty;i++)
//		{
//			m[i].print_price();
//		}
//		cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//		cout << "===============================================================================================" << endl;
//		cout << "Код    Стоимость    Стоимость проживания    Стоимость     Стоимость услуг    Общая       Валюта" << endl;
//		cout << "        проезда          и питания          тур. услуги   воспитателя        стоимость                   " << endl;
//		cout << "===============================================================================================" << endl;
//		for(int i=0;i<count_wellness;i++)
//		{
//			w[i].print_price();
//		}
//		cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//		cout << "==============================================================================================================" << endl;
//		cout << "Код   Стоимость    Стоим.проживания   Стоимость    Страховка   Стоим. услуг   Стоимость     Общая       Валюта" << endl;
//		cout << "       проезда         и питания      тур. услуги              воспитателя    мед.процедур  стоимость" << endl;
//		cout << "==============================================================================================================" << endl;
//		for(int i=0;i<count_ch_sea;i++)
//		{
//			sch[i].print_price();
//		}
//		system("pause");
//		break;
//
//	}
//}
//}
//
//void user_Work()
//{
//
//	char country[30],hotel[20],Ftip[10],Name[30],kod_tour[10],passport[20],Name_sotr[30],res_kod[20];
//	int cost,k,tel_number,date_viezd[3],date_reg[3],d,mn,y,date[3];
//	Tour *t[50],*tm[50],*tw[50],*ts[50];//*tr,*tr1,*tr2,*tr3;
//	Sea_Tour s[20];
//	Mounty_Tour m[20];
//	Child_Tour w[20];
//	Sea_Child_Tour sch[20];
//	Client <int,char> *pl[20];
//	//Client <int,char> cl[20];
//	//Sea_Tour s;
//	//Mounty_Tour m;
//	//Child_Tour w;
//	//Sea_Child_Tour sch;
//	//tr=&s;
//	//tr1=&m;
//	//tr2=&w;
//	//tr3=&sch;
//	system("pause");
//	int number;
//	int count_mounty=0;
//	int count_wellness=0;
//	int count_ch_sea=0;//Sea_Child_Tour
//	int count=0;
//	int count_cl=0;
//	count=s->open_File(s);//////ЧТЕНИЕ ИЗ ФАЙЛА
//	count_mounty =m->open_File(m);
//	count_wellness=w->open_File(w);
//	count_ch_sea=sch->open_File(sch);
//	//count_cl=cl->open_File(cl);
//	//pl[0]=new Client<int,char>;
//	count_cl=pl[0]->open_File(pl);
//	/////////////////////////////////////////////////////////////////////////////////////
//
//	int i,x;
//	while(1){
//		system("cls");
//		int Cl=0,Tr=0,Pr=0;
//	switch(MenuAdmin())
//	{
//	case '0': return;
//		///////////////////////////////////////////////РАБОТА С КЛИЕНТАМИ////////////////////////////////////
//	case '1':
//		while (!Cl) {
//			system("cls");
//			switch (Menu_for_Clients_pols()) {
//			case 1:
//				if(!count&&!count_wellness&&!count_mounty&&!count_ch_sea)
//				{
//					cout<< "Нет данных о турах"<<endl;
//					system("pause");
//				}
//				else{
//				cout << "\nДОСТУПНЫЕ ТУРЫ" << endl << endl;
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				//cout<< s.get_currency() << endl;
//				for(int j=0;j<count;j++)
//					t[j]=&s[j];
//				for(i=0; i<count; i++)
//				{
//					cout <<  i+1 <<".";
//					t[i]->print();
//					//s[i].print();
//
//				}
//				cout << "\n===============================================================================================" << endl;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(i=0; i<count_mounty; i++)
//				{
//					tm[i]=&m[i];
//				}
//				for(i=0; i<count_mounty; i++)
//				{
//					cout <<  i+1 <<".";
//					tm[i]->print();
//				}
//				cout << "\n===========================================================================================================" << endl;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for(i=0; i<count_wellness; i++)
//				{
//					tw[i]=&w[i];
//				}
//				for(i=0; i<count_wellness; i++)
//				{
//					cout <<  i+1 <<".";
//					tw[i]->print();
//				}
//				cout << "\n=============================================================================================================" << endl;
//
//				cout << "\n=============================================================================================================" << endl;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "===============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "===============================================================================================================" << endl;
//				for(i=0; i<count_ch_sea; i++)
//				{
//					ts[i]=&sch[i];
//				}
//				for(i=0; i<count_ch_sea; i++)
//				{
//					cout <<  i+1 <<".";
//					ts[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//				cout << "Введите фамилию клиента: ";
//			fflush stdin;
//			gets( Name);
//			cout << "Введите номер телефона: ";
//			cin >> tel_number;
//		    cout << "Введите номер  паспорта: ";
//			fflush stdin;
//			gets(passport);
//			cout << "Введите код выбранного тура: ";
//            fflush stdin;
//			gets(kod_tour);
//			cout << "Введите Дату выезда" << endl;
//			cout << "Введите день: ";
//			cin >> date_viezd[0];
//			cout << "Введите месяц: ";
//			cin >> date_viezd[1];
//			cout << "Введите год: ";
//			cin >> date_viezd[2];
//			cout << "Введите фамилию сотрудника-регистратора: ";
//			fflush stdin;
//			gets(Name_sotr);
//			cout << "Введите Дату оформления путёвки" << endl;
//			cout << "Введите день: ";
//			cin >> date_reg[0];
//			cout << "Введите месяц: ";
//			cin >> date_reg[1];
//			cout << "Введите год: ";
//			cin >> date_reg[2];
//			for(int i=0;i<count;i++)
//			{
//				x=s[i].sravn(kod_tour,date_viezd);
//				//cout<< x<< endl;
//				if(x)break;
//			}
//			for(int i=0;i<count_mounty&&!x;i++)
//			{
//				x=m[i].sravn(kod_tour,date_viezd);
//				//cout<< x<< endl;
//				if(x)break;
//			}
//			for(int i=0;i<count_wellness&&!x;i++)
//			{
//				x=w[i].sravn(kod_tour,date_viezd);
//				//cout<< x<< endl;
//				if(x)break;
//			}
//			for(int i=0;i<count_ch_sea&&!x;i++)
//			{
//				x=sch[i].sravn(kod_tour,date_viezd);
//				//cout<< x<< endl;
//				if(x)break;
//			}
//			if(!x) {
//				cout << endl;
//				cout <<"НЕКОРРЕКТНЫЙ ВВОД!" <<endl;
//			system("pause");
//			}
//			else{
//				i=count_cl;
//				pl[i]= new Client<int,char>;
//				pl[i]->set_name_kl(Name);
//				pl[i]->set_tel_numder(tel_number);
//				pl[i]->set_passport(passport);
//				pl[i]->set_kod_tour(kod_tour);
//				pl[i]->set_date_viezd(date_viezd);
//				pl[i]->set_sotr(Name_sotr);
//				pl[i]->set_date_reg(date_reg);
//				//pl[i]= new Client<int,char>;
//				//pl[i]->add();
//				////cl[i].add();
//				count_cl++;
//				pl[0]->write_File(pl,count_cl);
//				s->write_File(s,i,count);
//				m->write_File(m,count_mounty);
//				w->write_File(w,count_wellness);
//				sch->write_File(sch,count_ch_sea);
//				system("pause");
//			}
//			}
//				//cl->write_File(cl,count_cl);
//				break;
//			case 2:
//				i=count_cl;
//				cout << "==============================================================================================" << endl;
//				cout << " ФИО клиента     Телефон     Номер       Код тура    Дата       ФИО           Дата" << endl ;
//				cout << "                             паспорта                выезда     регистратора  регистрации" << endl;
//				cout << "==============================================================================================" << endl;
//				for(int i=0;i<count_cl;i++)
//				{
//					cout <<  i+1 <<".";
//					pl[i]->see();
//					//cl[i].see();
//				}
//				if(!i) 
//				{
//					cout << "Нет данных о клиентах" << endl;
//				}
//				system("pause");
//				break;
//				////////////////////////////////////ОТЧЁТ ПО МЕСЯЦУ///////////////////////////////////////////////////////////////////////////////////
//
//			case 0:Cl=1;
//				break;
//			}
//			
//		}
//		break;
//		///////////////////////////////////////////////РАБОТА С ТУРАМИ////////////////////////////////////////////////
//	case '2': 
//
//		while (!Tr) {
//			system("cls");
//			switch (Menu_operations_Pols()) {
//					
//				
//				////////////////////////////////////////////ПРОСМОТР/////////////////////////////////////////////////////////////////////////////
//			case 1:
//				cout << "\nДОСТУПНЫЕ ТУРЫ" << endl << endl;
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				//cout<< s.get_currency() << endl;
//				for(int j=0;j<count;j++)
//					t[j]=&s[j];
//				for(i=0; i<count; i++)
//				{
//					cout <<  i+1 <<".";
//					t[i]->print();
//					//s[i].print();
//
//				}
//				cout << "\n================================================================================================" << endl;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(i=0; i<count_mounty; i++)
//				{
//					tm[i]=&m[i];
//				}
//				for(i=0; i<count_mounty; i++)
//				{
//					cout <<  i+1 <<".";
//					tm[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for(i=0; i<count_wellness; i++)
//				{
//					tw[i]=&w[i];
//				}
//				for(i=0; i<count_wellness; i++)
//				{
//					cout <<  i+1 <<".";
//					tw[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//
//				cout << "\n==============================================================================================" << endl;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "================================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "================================================================================================================" << endl;
//				for(i=0; i<count_ch_sea; i++)
//				{
//					ts[i]=&sch[i];
//				}
//				for(i=0; i<count_ch_sea; i++)
//				{
//					cout <<  i+1 <<".";
//					ts[i]->print();
//				}
//				cout << "\n==============================================================================================" << endl;
//
//				system("pause");
//				break;
//	
//			case 2:
//				k=0;
//				cout << "Введите страну для поиска: ";
//				fflush stdin;
//				gets(country);
//				cout << "Введите максимальную стоимость для поиска:                BR\b\b\b\b\b\b\b\b\b\b\b";
//				cin >> cost;
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//
//				for( i=0;i<count;i++)
//				{
//					x=s[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for( i=0;i<count_mounty;i++)
//				{
//					x=m[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for(int i=0;i<count_wellness;i++)
//				{
//					x=w[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "================================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "================================================================================================================" << endl;
//				for( i=0;i<count_ch_sea;i++)
//				{
//					x=sch[i].poisk_country_cost(country,cost);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				system("pause");
//				break;
//				//////////////////////////////////////////////ПОИСК/////////////////////////////////////////////////////////////////
//			case 3:
//				k=0;
//				cout << "Введите количество звёзд отеля: ";
//				fflush stdin;
//				gets(hotel);
//				cout << "Введите тип питания (AL,BB,HB): ";
//				fflush stdin;
//				gets(Ftip);
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for( i=0;i<count;i++)
//				{
//					x=s[i].poisk_hotel_ftip(hotel,Ftip);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				k=0;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for(int i=0;i<count_mounty;i++)
//				{
//					x=m[i].poisk_hotel_ftip(hotel,Ftip);
//					if(x) k++;
//				}
//				if(!k) cout << "Не найдено туров" << endl;
//				system("pause");
//				break;
//				///////////////////////////////////////////////////////////////////////////////////
//			case 4:
//				k=0;
//				cout << "Сегоднишнюю ДАТУ" << endl;
//				cout << "Введите день: " ;
//				cin >> date[0];
//				cout << "Введите  месяц: " ;
//				cin >> date[1];
//				cout << "Введите год: " ;
//				cin >>  date[2];
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for( i=0;i<count;i++)
//				{
//					x=s[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout  << setw(98) <<"Не найдено туров" << endl;
//				k=0;
//				cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//				cout << "==================================================================================================" << endl;
//				cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//				cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				cout << "==================================================================================================" << endl;
//				for( i=0;i<count_mounty;i++)
//				{
//					x=m[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout << setw(98) <<"Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//				cout << "=============================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//				cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//				cout << "=============================================================================================================" << endl;
//				for( i=0;i<count_wellness;i++)
//				{
//					x=w[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout  << setw(98) <<"Не найдено туров" << endl;
//				k=0;
//				cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//				cout << "=================================================================================================================" << endl;
//				cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//				cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//				cout << "=================================================================================================================" << endl;
//				for( i=0;i<count_ch_sea;i++)
//				{
//					x=sch[i].poisk_hot_tour(date);
//					if(x) k++;
//				}
//				if(!k) cout << setw(98) << "Не найдено туров" << endl;
//				system("pause");
//				break;
//			case 0: Tr=1;
//				break;
//			}
//		}
//
//		break;
//
//
//
//		////////////////////////////////////////////////ПРАЙС ЛИСТ/////////////////////////////////////////////
//	case '3':
//		cout << "\nМОРСКИЕ ТУРЫ" << endl;
//		cout << "==============================================================================================" << endl;
//		cout << "Код    Стоимость    Стоимость проживания       Стоимость      Страховка    Общая      Валюта  " << endl;
//		cout << "        проезда          и питания            тур. услуги                  стоимость          " << endl;
//		cout << "==============================================================================================" << endl;
//		for(int i=0;i<count;i++)
//		{
//			s[i].print_price();
//		}
//
//		cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//		cout << "=========================================================================================================" << endl;
//		cout << "Код    Стоимость    Стоимость проживания    Стоимость       Страховка  Стоимость       Общая       Валюта" << endl;
//		cout << "        проезда          и питания          тур. услуги                горнолыжного    стоимость  " << endl;
//		cout << "                                                                       инвентаря " << endl;  
//		cout << "=========================================================================================================" << endl;
//		for(int i=0;i<count_mounty;i++)
//		{
//			m[i].print_price();
//		}
//		cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//		cout << "===============================================================================================" << endl;
//		cout << "Код    Стоимость    Стоимость проживания    Стоимость     Стоимость услуг    Общая       Валюта" << endl;
//		cout << "        проезда          и питания          тур. услуги   воспитателя        стоимость                   " << endl;
//		cout << "===============================================================================================" << endl;
//		for(int i=0;i<count_wellness;i++)
//		{
//			w[i].print_price();
//		}
//		cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//		cout << "==============================================================================================================" << endl;
//		cout << "Код   Стоимость    Стоим.проживания   Стоимость    Страховка   Стоим. услуг   Стоимость     Общая       Валюта" << endl;
//		cout << "       проезда         и питания      тур. услуги              воспитателя    мед.процедур  стоимость" << endl;
//		cout << "==============================================================================================================" << endl;
//		for(int i=0;i<count_ch_sea;i++)
//		{
//			sch[i].print_price();
//		}
//		system("pause");
//		break;
//
//	}
//}
//}




//void WorkDateTours()
//{
//	char kod[10],country[80],city[20],hotel[20],type_of_room[20],food_tip[20];
//	int date[3],length,total_cost,visa,insurance,kol,cost_of_living,comission;
//	int nn,day[5],month[5],year[5],koll[5],cost_trans;
//	Tour *t[50],*tm[50],*tw[50],*ts[50],*tr,*tr1,*tr2,*tr3;
//	Sea_Tour s[20];
//	Mounty_Tour m[20];
//	Child_Tour w[20];
//	Sea_Child_Tour sch[20];
//	//Sea_Tour s;
//	//Mounty_Tour m;
//	//Child_Tour w;
//	//Sea_Child_Tour sch;
//	//tr=&s;
//	//tr1=&m;
//	//tr2=&w;
//	//tr3=&sch;
//	system("pause");
//	int number;
//	int count_mounty=0;
//	int count_wellness=0;
//	int count_ch_sea=0;//Sea_Child_Tour
//	int count=0;
//
//	//t[count]=new Sea_Tour;
//				count=s->open_File(s);//////ЧТЕНИЕ ИЗ ФАЙЛА
//			 count_mounty =m->open_File(m);
//			 count_wellness=w->open_File(w);
//			 count_ch_sea=sch->open_File(sch);
//							//cout<<count_wellness<<endl;
//	/*			for(j=0;j<count;j++)
//t[j]=&s[j];*/
//	
//	/////////////////////////////////////////////////////////////////////////////////////
//		
//
//	//cout <<count<< endl;
//	system("pause");
//	int i,x;
//	while (1) {
//		system("cls");
//		switch (Menu_operations_Admin()) {
//		case 1: 
//			switch (Menu_choice_tour())
//			{
//				//system("cls");
//			case 1: 
//				i=count;
//				//t[i]=new Sea_Tour;////////////////////с полиморф.
//				//t[i]->add(t,i,count);
//				s[i].add(t,i,count);
//				count++;
//		
//			/*	for(int k=0;k<count;k++)
//				t[k]->write_File(t,k,count);*/
//				//for(int k=0;k<count;k++)
//				s->write_File(s,i,count);
//				cout<< count<<endl;
//				system("pause");
//				break;
//
//			case 2:
//				i=count_mounty;
//				//tm[i]=new Mounty_Tour;
//				//tm[i]->add(tm,i,count_mounty);
//				m[i].add();
//				count_mounty++;
//				m->write_File(m,count_mounty);
//				////tr1->write_File(tm,count_mounty);
//				system("pause");
//				break;
//
//			case 3:
//				i=count_wellness;
//				//tw[i]=new Child_Tour;
//				//tw[i]->add(tw,i,count_wellness);
//				w[i].add();
//				count_wellness++;
//				////tr2->write_File(tw,count_wellness);
//				w->write_File(w,count_wellness);
//				system("pause");
//				break;
//
//			case 4:
//				i=count_ch_sea;
//				//ts[i]=new Sea_Child_Tour;
//				//ts[i]->add(ts,i,count_ch_sea);
//				sch[i].add();
//				count_ch_sea++;
//				sch->write_File(sch,count_ch_sea);
//				////tr2->write_File(tw,count_wellness);
//				system("pause");
//				break;
//			}
//			break;
//////////////////////////////////////////////ПРОСМОТР/////////////////////////////////////////////////////////////////////////////
//		case 2:
//			cout << "\nДОСТУПНЫЕ ТУРЫ" << endl << endl;
//			cout << "\nМОРСКИЕ ТУРЫ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//			cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//			//cout<< s.get_currency() << endl;
//					for(int j=0;j<count;j++)
//t[j]=&s[j];
//			for(i=0; i<count; i++)
//			{
//				cout <<  i+1 <<".";
//				t[i]->print();
//				//s[i].print();
//
//			}
//			cout << "\n==============================================================================================" << endl;
//			cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//			cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//			for(i=0; i<count_mounty; i++)
//			{
//				tm[i]=&m[i];
//			}
//			for(i=0; i<count_mounty; i++)
//			{
//				cout <<  i+1 <<".";
//				tm[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//			cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//			cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//			for(i=0; i<count_wellness; i++)
//			{
//				tw[i]=&w[i];
//			}
//			for(i=0; i<count_wellness; i++)
//			{
//				cout <<  i+1 <<".";
//				tw[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//			cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//			for(i=0; i<count_ch_sea; i++)
//			{
//				ts[i]=&sch[i];
//			}
//			for(i=0; i<count_ch_sea; i++)
//			{
//				cout <<  i+1 <<".";
//				ts[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//
//			system("pause");
//			break;
//	///////////////////////////////////////////////РЕДАКТИРОВАНИЕ///////////////////////////////////////////////////////////////////////////
//		case 3:
//			switch (Menu_choice_tour())
//			{
//			case 1:
//			cout << "\nМОРСКИЕ ТУРЫ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//			cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//				//cout<< s.get_currency() << endl;
//				for(int j=0;j<count;j++)
//t[j]=&s[j];
//				for(i=0; i<count; i++)
//				{
//					cout <<  i+1 <<".";
//					t[i]->print();
//				}
//				
//				cout << endl; cout << "Введите номер тура для изменения" << endl;
//				number=s->enterRecordNumber(count);
//				s[number-1].red();
//				s->write_File(s,i,count);
//				system("pause");
//				break;
//
//			case 2:
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//			cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//			for(i=0; i<count_mounty; i++)
//				tm[i]=&m[i];
//			for(i=0; i<count_mounty; i++)
//			{
//				cout <<  i+1 <<".";
//				tm[i]->print();
//			}
//			
//			cout << "\n==============================================================================================" << endl;
//			if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{
//				cout << endl; cout << "Введите номер тура для изменения" << endl;
//				number=m->enterRecordNumber(count_mounty);
//				m[number-1].red();
//				m->write_File(m,count_mounty);
//				system("pause");
//			}
//			break;
//
//			case 3:
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//			cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//			for(i=0; i<count_wellness; i++)
//				tw[i]=&w[i];
//			for(i=0; i<count_wellness; i++)
//			{
//				cout <<  i+1 <<".";
//				tw[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//		
//			if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{
//				cout << endl; cout << "Введите номер тура для изменения" << endl;
//				number=w->enterRecordNumber(count_wellness);
//				w[number-1].red();
//				w->write_File(w,count_wellness);
//				system("pause");
//			}
//			
//			break;
//
//			case 4:
//				cout << "\n==============================================================================================" << endl;
//
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//			cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//			for(i=0; i<count_ch_sea; i++)
//				ts[i]=&sch[i];
//			for(i=0; i<count_ch_sea; i++)
//			{
//				cout <<  i+1 <<".";
//				ts[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//			if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{
//				cout << endl; cout << "Введите номер тура для изменения" << endl;
//				number=sch->enterRecordNumber(count_ch_sea);
//				sch[number-1].red();
//				sch->write_File(sch,count_ch_sea);
//				system("pause");
//			}
//			}
//			
//			break;
//	///////////////////////////////////////////////УДАЛЕНИЕ/////////////////////////////////////////////////////////////////////
//		case 4:
//			switch (Menu_choice_tour())
//			{
//			case 1:
//
//				cout << "\nМОРСКИЕ ТУРЫ" << endl;
//				cout << "==============================================================================================" << endl;
//				cout << "  Код  Страна      Курорт      Отель         Колич.    Дата        Всего    Общая      Валюта"  ;
//				cout << "                                             путёвок   вылета      ночей    стоимость" << endl;
//				//cout<< s.get_currency() << endl;
//
//				for(i=0; i<count_mounty; i++)
//				t[i]=&s[i];
//				for(i=0; i<count; i++)
//				{
//					cout <<  i+1 <<".";
//					t[i]->print();
//				}
//				if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{
//				cout << endl; cout << "Введите номер для удаления" << endl;
//				number=s->enterRecordNumber(count);
//				for(i=number-1;i<count;i++)
//					s[i]=s[i+1];
//				count --;
//				s->write_File(s,i,count);
//				system("pause");
//			}
//				break;
//
//			case 2:
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна        Курорт    Отель  Тип      Дата        Колич.  Всего    Общая      Валюта" << endl ;
//			cout << "                                           питания  вылета      путёвок  ночей    стоимость" << endl;
//			for(i=0; i<count_mounty; i++)
//				tm[i]=&m[i];
//			for(i=0; i<count_mounty; i++)
//			{
//				cout <<  i+1 <<".";
//				tm[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//			if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{
//				cout << endl; cout << "Введите номер для удаления" << endl;
//				number=m->enterRecordNumber(count_mounty);
//				for(i=number-1;i<count_mounty;i++)
//					m[i]=m[i+1];
//				count_mounty --;
//				m->write_File(m,count_mounty);
//				system("pause");
//			}
//			break;
//
//
//			case 3:
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nДЕТСКИЕ ЛАГЕРЯ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна         Город       Лагерь        Дата        Колич.   Всего    Возраст  Общая      Валюта" << endl ;
//			cout << "                                                    вылета       путёвок  ночей             стоимость" << endl;
//			for(i=0; i<count_wellness; i++)
//				tw[i]=&w[i];
//			for(i=0; i<count_wellness; i++)
//			{
//				cout <<  i+1 <<".";
//				tw[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//		
//			if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{
//				cout << endl; cout << "Введите номер для удаления" << endl;
//				number=w->enterRecordNumber(count_wellness);
//				for(i=number-1;i<count_wellness;i++)
//					w[i]=w[i+1];
//				count_wellness --;
//				w->write_File(w,count_wellness);
//				system("pause");
//			}
//			break;
//
//			case 4:
//				cout << "\n==============================================================================================" << endl;
//
//				cout << "\n==============================================================================================" << endl;
//			cout << "\nДЕТСКИЕ САНАТОРИИ" << endl;
//			cout << "==============================================================================================" << endl;
//			cout << "  Код       Страна         Город       Санаторий  Тип      Дата        Колич.  Всего  Возраст  Общая      Валюта" << endl ;
//			cout << "                                                  питания вылета       путёвок ночей           стоимость" << endl;
//			for(i=0; i<count_ch_sea; i++)
//				ts[i]=&sch[i];
//			for(i=0; i<count_ch_sea; i++)
//			{
//				cout <<  i+1 <<".";
//				ts[i]->print();
//			}
//			cout << "\n==============================================================================================" << endl;
//			if(!i)
//			{
//				cout << "Нет записей" <<endl;
//			system("pause");
//			}
//			else{cout << endl; cout << "Введите номер для удаления" << endl;
//				number=sch->enterRecordNumber(count_ch_sea);
//				for(i=number-1;i<count_ch_sea;i++)
//					sch[i]=sch[i+1];
//				count_ch_sea --;	
//					sch->write_File(sch,count_ch_sea);
//				system("pause");
//			}
//			break;
//				//					fflush stdin;
//				//			        gets(city);
//				//					for(i=0; i<count; i++)
//			}
//
//			//cout << "\nДОСТУПНЫЕ ТУРЫ" << endl << endl;
//			//			cout << "\nМОРСКИЕ ТУРЫ" << endl;
//			//			cout << "==============================================================================================" << endl;
//			//			cout << "  Код  Страна      Курорт      Отель         Колич.    Дата        Всего    Общая      Валюта"  ;
//			//	        cout << "                                             путёвок   вылета      ночей    стоимость" << endl;
//			//			//cout<< s.get_currency() << endl;
//			//			for(i=0; i<count; i++)
//			//		{
//			//			cout <<  i+1 <<".";
//			//			t[i]->print();
//			//		}
//			//			cout << "\n==============================================================================================" << endl;
//			//			cout << "\nГОРНОЛЫЖНЫЕ ТУРЫ" << endl;
//			//			cout << "==============================================================================================" << endl;
//			//			cout << "  Код  Страна      Курорт      Отель         Колич.    Дата        Всего    Общая      Валюта"  ;
//			//	        cout << "                                             путёвок   вылета      ночей    стоимость" << endl;
//			//			for(i=0; i<count_mounty; i++)
//			//		{
//			//			cout <<  i+1 <<".";
//			//			tm[i]->print();
//			//		}
//			//			cout << "\n==============================================================================================" << endl;
//			//			cout << "\nОЗДОРОВИТЕЛЬНЫЕ ТУРЫ" << endl;
//			//			cout << "==============================================================================================" << endl;
//			//			cout << "  Код  Страна      Курорт      Отель         Колич.    Дата        Всего    Общая      Валюта"  ;
//			//	        cout << "                                             путёвок   вылета      ночей    стоимость" << endl;
//			//			for(i=0; i<count_wellness; i++)
//			//		{
//			//			cout <<  i+1 <<".";
//			//			tw[i]->print();
//			//		}
//			//			cout << "\n==============================================================================================" << endl;
//			//			char number[5];
//			//			x=0;
//			//					cout << endl; cout << "Введите код тура для изменения" << endl;
//			//				    //number = enterRecordNumber();
//			//					fflush stdin;
//			//			        gets(city);
//			//					for(i=0; i<count; i++)
//			//		{
//			//			if(!strcmp(number,t[i]->get_kod()))
//			//				x++;
//			//		}
//			/*while (number > 50 || number > n)
//			{
//			cout << endl; cout << "Записи с таким номером не существует!" << endl;
//			cout << "Повторите ввод, пожалуйста: " << endl;
//			number = enterRecordNumber();
//			}*/
//
//			break;
//		case 0: return;
//		}
//	}
//	
//	//tr->write_File(t,count);
//	
//}